In [2]:
import pandas as pd

# 시리즈
a = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
a

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
# DataFrame
df = pd.DataFrame([['한빛', '남자', '20', '180'],
                   ['한결', '남자', '21', '177'],
                   ['한라', '여자', '20', '160']],
                  columns=['이름', '성별', '나이', '키'])
df

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [4]:
df2 = pd.DataFrame({'이름': {0: '한빛', 1: '한결', 2: '한라'},
                    '성별': {0: '남자', 1: '남자', 2: '여자'},
                    '나이': {0: '20', 1: '21', 2:'20'},
                    '키': {0: '180', 1: '177', 2: '160'}})
df2

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [5]:
df3 = pd.DataFrame({'이름': ['한빛','한결','한라'],
                    '성별': ['남자','남자','여자'],
                    '나이': ['20','21','20'],
                    '키': ['180','177','160']})
df3

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [9]:
# pandas -> numpy
# 데이터프레임에 to_numpy()함수를 호출한다.
np_value = df.to_numpy()
print(np_value)

[['한빛' '남자' '20' '180']
 ['한결' '남자' '21' '177']
 ['한라' '여자' '20' '160']]

In [11]:
import numpy as np

# numpy -> pandas
# pd.DataFrame(numpy데이터)
arr = np.array([['한빛', '남자', '20', '180'],
                ['한결', '남자', '21', '177'],
                ['한라', '여자', '20', '160']])
col_names = ['이름', '성별', '나이', '키']
df4 = pd.DataFrame(arr, columns=col_names)
df4

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [14]:
# CSV 파일로 데이터프레임 생성
df5 = pd.read_csv('chocolate_rating.csv', header=None)
df5

         0     1     2     3
0        1  2016  0.63  3.75
1        2  2015  0.70  2.75
2        3  2015  0.70  3.00
3        4  2015  0.70  3.50
4        5  2015  0.70  3.50
...    ...   ...   ...   ...
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

[1795 rows x 4 columns]

In [20]:
df5.to_csv('chocolate_rating1.csv', header=None)

In [22]:
df.columns

Index(['이름', '성별', '나이', '키'], dtype='object')

In [23]:
df5.describe()

                 0            1            2            3
count  1795.000000  1795.000000  1795.000000  1795.000000
mean    898.000000  2012.325348     0.717003     3.185933
std     518.316184     2.927210     0.063230     0.478062
min       1.000000  2006.000000     0.420000     1.000000
25%     449.500000  2010.000000     0.700000     2.875000
50%     898.000000  2013.000000     0.700000     3.250000
75%    1346.500000  2015.000000     0.750000     3.500000
max    1795.000000  2017.000000     1.000000     5.000000

In [24]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795 entries, 0 to 1794
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1795 non-null   int64
 1   1       1795 non-null   int64
 2   2       1795 non-null   float64
 3   3       1795 non-null   float64
dtypes: float64(2), int64(2)
memory usage: 56.2 KB

In [28]:
df5.head(10)

    0     1     2     3
0   1  2016  0.63  3.75
1   2  2015  0.70  2.75
2   3  2015  0.70  3.00
3   4  2015  0.70  3.50
4   5  2015  0.70  3.50
5   6  2014  0.70  2.75
6   7  2014  0.70  3.50
7   8  2014  0.70  3.50
8   9  2014  0.70  3.75
9  10  2014  0.70  4.00

In [30]:
df5.tail(10)

         0     1     2     3
1785  1786  2012  0.75  3.00
1786  1787  2012  0.90  3.25
1787  1788  2012  0.70  3.75
1788  1789  2012  0.68  3.25
1789  1790  2012  0.58  3.50
1790  1791  2011  0.70  3.75
1791  1792  2011  0.65  3.00
1792  1793  2011  0.65  3.50
1793  1794  2011  0.62  3.25
1794  1795  2010  0.65  3.00

In [33]:
df6 = pd.DataFrame([['허준호', '남자', '30', '183'],
                    ['이가원', '여자', '24', '162'],
                    ['배규민', '남자', '23', '179'],
                    ['고고림', '남자', '21', '182'],
                    ['이새봄', '여자', '28', '160'],
                    ['이보람', '여자', '26', '163'], 
                    ['이루리', '여자', '24', '157'],
                    ['오다현', '여자', '24', '172']],
                   columns=['이름', '성별', '나이', '키'])

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [38]:
df6.sort_index(axis=1, ascending=True)

   나이  성별   이름    키
0  30  남자  허준호  183
1  24  여자  이가원  162
2  23  남자  배규민  179
3  21  남자  고고림  182
4  28  여자  이새봄  160
5  26  여자  이보람  163
6  24  여자  이루리  157
7  24  여자  오다현  172

In [41]:
df6.sort_values(by=['나이', '키'], ascending=True)

    이름  성별  나이    키
3  고고림  남자  21  182
2  배규민  남자  23  179
6  이루리  여자  24  157
1  이가원  여자  24  162
7  오다현  여자  24  172
5  이보람  여자  26  163
4  이새봄  여자  28  160
0  허준호  남자  30  183

In [43]:
# 데이터 조회
# 데이터프레임[조건식] => Series로 출력
# 데이터프레임[[조건식]] => DataFrame으로 출력
df6[['이름', '나이', '키']] # 데이터프레임으로 반환

    이름  나이    키
0  허준호  30  183
1  이가원  24  162
2  배규민  23  179
3  고고림  21  182
4  이새봄  28  160
5  이보람  26  163
6  이루리  24  157
7  오다현  24  172

In [44]:
df6['이름'] # 시리즈로 반환

0    허준호
1    이가원
2    배규민
3    고고림
4    이새봄
5    이보람
6    이루리
7    오다현
Name: 이름, dtype: object

In [46]:
df6['키']

0    183
1    162
2    179
3    182
4    160
5    163
6    157
7    172
Name: 키, dtype: object

In [47]:
# loc[]: location => 
# iloc[]: integer location => 숫자 인덱스 형태로 조회

df6.loc[0:3, '나이']

0    30
1    24
2    23
3    21
Name: 나이, dtype: object

In [49]:
df6.iloc[0:4, 2]

0    30
1    24
2    23
3    21
Name: 나이, dtype: object

In [54]:
# df6.info()
df6[['나이', '키']] = df6[['나이', '키']].astype(dtype=int)
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   성별      8 non-null      object
 2   나이      8 non-null      int64
 3   키       8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [55]:
df6

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [57]:
# numpy[조건식]
# df[[조건식]]
df6[df6['키'] >= 180]

    이름  성별  나이    키
0  허준호  남자  30  183
3  고고림  남자  21  182

In [59]:
df6[(df6['성별'] == '여자') & (df6['키'] >= 160)]

    이름  성별  나이    키
1  이가원  여자  24  162
4  이새봄  여자  28  160
5  이보람  여자  26  163
7  오다현  여자  24  172

In [60]:
df6[(df6['나이'] >= 28) | (df6['성별'] == '남자')]

    이름  성별  나이    키
0  허준호  남자  30  183
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160

In [61]:
df6[df6['나이'].isin([21, 23])]

    이름  성별  나이    키
2  배규민  남자  23  179
3  고고림  남자  21  182

In [68]:
# df5의 카카오 함유량이 0.7인 데이터만 출력하시오.
df5[df5[2].isin([0.7])]

         0     1    2     3
1        2  2015  0.7  2.75
2        3  2015  0.7  3.00
3        4  2015  0.7  3.50
4        5  2015  0.7  3.50
5        6  2014  0.7  2.75
...    ...   ...  ...   ...
1771  1772  2016  0.7  3.50
1781  1782  2012  0.7  3.00
1782  1783  2012  0.7  3.50
1787  1788  2012  0.7  3.75
1790  1791  2011  0.7  3.75

[672 rows x 4 columns]

In [71]:
# df5의 평점이 4.0 이상이고 카카오 함유량이 0.71 이상이면서 연도가 2015년도인 초콜릿을 출력하시오.
df5[(df5[3] >= 4.0) & (df5[2] >= 0.71) & (df5[1] == 2015)]

         0     1     2    3
1203  1204  2015  0.75  4.0
1487  1488  2015  0.72  4.0
1515  1516  2015  0.75  4.0

In [73]:
# 문자가 포함되어 있는지
df6[df6['이름'].str.contains('봄')]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   성별      8 non-null      object
 2   나이      8 non-null      int64
 3   키       8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [79]:
df6.loc[4, '키'] = df6.loc[4, '키'] + 5
df6

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  175
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [82]:
df6.loc[4, '키'] = df6.loc[4, '키'] - 5
df6

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [88]:
df6.loc[1:3, '키'] = [None] * 3
df6

    이름  성별  나이     키
0  허준호  남자  30   183
1  이가원  여자  24  None
2  배규민  남자  23  None
3  고고림  남자  21  None
4  이새봄  여자  28   160
5  이보람  여자  26   163
6  이루리  여자  24   157
7  오다현  여자  24   172

In [89]:
df6.loc[1:3, '키'] = [162, 179, 182]
df6

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [91]:
# 데이터프레임 구조 수정
df7 = df6.set_index('이름', inplace=False)
df7

     성별  나이    키
이름
허준호  남자  30  183
이가원  여자  24  162
배규민  남자  23  179
고고림  남자  21  182
이새봄  여자  28  160
이보람  여자  26  163
이루리  여자  24  157
오다현  여자  24  172

In [92]:
df6['보너스'] = df6['나이'] * 10000
df6

    이름  성별  나이    키     보너스
0  허준호  남자  30  183  300000
1  이가원  여자  24  162  240000
2  배규민  남자  23  179  230000
3  고고림  남자  21  182  210000
4  이새봄  여자  28  160  280000
5  이보람  여자  26  163  260000
6  이루리  여자  24  157  240000
7  오다현  여자  24  172  240000

In [97]:
# df6.drop('보너스', axis=1, inplace=True)
df6['키'] = df6['키'].astype(int)
df6

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [99]:
df7.reset_index(inplace=True)
df7

    이름  성별  나이    키
0  허준호  남자  30  183
1  이가원  여자  24  162
2  배규민  남자  23  179
3  고고림  남자  21  182
4  이새봄  여자  28  160
5  이보람  여자  26  163
6  이루리  여자  24  157
7  오다현  여자  24  172

In [100]:
# 데이터 치환
df8 = df7.replace({'성별': {'남자': 1, '여자': 0}}, inplace=False)
df8

    이름  성별  나이    키
0  허준호   1  30  183
1  이가원   0  24  162
2  배규민   1  23  179
3  고고림   1  21  182
4  이새봄   0  28  160
5  이보람   0  26  163
6  이루리   0  24  157
7  오다현   0  24  172

In [108]:
mean_by_gender = df6.groupby(['성별'], as_index=False)['키'].mean()
mean_by_gender.rename(columns={'키': '평균 키'}, inplace=True)
mean_by_gender

std_by_gender = df6.groupby(['성별'], as_index=False)['키'].std()
std_by_gender.rename(columns={'키': '키의 표준편차'}, inplace=True)
std_by_gender

new_df = pd.merge(mean_by_gender, std_by_gender)
new_df

   성별        평균 키   키의 표준편차
0  남자  181.333333  2.081666
1  여자  162.800000  5.630275

In [114]:
# 강의 시간표분석
time_table_df = pd.DataFrame([['C1', '인공지능개론', 'R1', 3],
                              ['C2', '웃음치료', 'R2', 2],
                              ['C3', '경영학', 'R3', 3],
                              ['C4', '3D디자인', 'R4', 4],
                              ['C5', '스포츠경영', 'R2', 2],
                              ['C6', '예술의 세계', 'R3', 1]],
                             columns=['과목번호', '과목명', '강의실', '시간수'])
time_table_df.to_csv('timetable.csv', index=False, encoding='utf-8')
df2 = pd.read_csv('timetable.csv')
df2['교수'] = ['김예희', '오정현', '인세훈', '이새봄', '배유진', '이가원']
df2
max_hour = df2.groupby(by=['강의실'], as_index=False)['시간수'].max()
max_hour

  강의실  시간수
0  R1    3
1  R2    2
2  R3    3
3  R4    4